#pragma once

// Таблица 2 (коэффициенты для нижнего высотного диапазона):

/* коэффициенты a из таблицы 2 для нижнего высотного диапазона */
extern double const a_low_table[8][7];


/* коэффициенты b из таблицы 2 для нижнего высотного диапазона */
extern double const b_low_table[6][7];


/* коэффициенты c из таблицы 2 для нижнего высотного диапазона */
extern double const c_low_table[6][7];


/* коэффициенты n из таблицы 2 для нижнего высотного диапазона */
extern double const n_low_table[3][7];


/* коэффициенты phi1 из таблицы 2 для нижнего высотного диапазона */
extern double const phi1_low_table[7];


/* коэффициенты d из таблицы 2 для нижнего высотного диапазона */
extern double const d_low_table[6][7];


/* коэффициенты e из таблицы 2 для нижнего высотного диапазона */
extern double const e_low_table[10][7];


/* коэффициенты et из таблицы 2 для нижнего высотного диапазона */
extern double const et_low_table[4][7];


/* коэффициенты l из таблицы 2 для нижнего высотного диапазона */
extern double const l_low_table[6][7];
