#pragma once

// Таблица 3 (коэффициенты для верхнего высотного диапазона):

/* коэффициенты a из таблицы 3 для верхнего высотного диапазона*/
extern double const a_high_table[8][7];


/* коэффициенты b из таблицы 3 для верхнего высотного диапазона*/
extern double const b_high_table[6][7];


/* коэффициенты c из таблицы 3 для верхнего высотного диапазона*/
extern double const c_high_table[6][7];


/* коэффициенты n из таблицы 3 для верхнего высотного диапазона */
extern double const n_high_table[3][7];


/* коэффициенты phi1 из таблицы 3 для нижнего высотного диапазона */
extern double const phi1_high_table[7];


/* коэффициенты d из таблицы 3 для верхнего высотного диапазона */
extern double const d_high_table[6][7];


/* коэффициенты e из таблицы 3 для верхнего высотного диапазона */
extern double const e_high_table[10][7];


/* коэффициенты et из таблицы 3 для верхнего высотного диапазона */
extern double const et_high_table[4][7];


/* коэффициенты l из таблицы 3 для верхнего высотного диапазона */
extern double const l_high_table[6][7];
